Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog
The WpfMaterialCatalog class represents a group of controls to select materials
using the material catalog.
WpfMaterialCatalog

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.#ctor(System.String)
Creates a new instance of the MaterialCatalog and will select
the material (if available) in the tree.
Material: The material to be selected in the dialog.

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.SelectedMaterial
Gets the selected material in the control.

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.ButtonWidth
Gets and sets the width of the button control.

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.ButtonHeight
Gets and sets the height of the button control.

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.button_Loaded(System.Object,System.Windows.RoutedEventArgs)
When the load event is raised, the control begins to enumerate through the material
catalog.
sender: The event sender.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.WindowBase.SetAttributeValue(System.String,System.Object) method of
the Tekla.Structures.Dialog.WindowBase class.

Tekla.Structures.Dialog.UIControls.WpfMaterialCatalog.InitializeComponent
InitializeComponent